<?php

require_once 'classes/AirLogistics.php';

echo '<br><br>= patterns/facede/index.php =<br><br>';
echo '------- patterns/faced ------- <br>';

/**
 * ФАСАД
 * 
 * Структурный паттерн проектирования, который
 * предоставляет простой интерфейс к сложной системе классов.
 * 
 * Какую-то логику, связанную с несколькими классами
 * нужно выносить в фасад, особенно, если этот код выполняется в контроллере.
 * 
 * В фасаде может множество различных методов, которые можно отнести к одной теме.
 */


// Примера нет, но вы держитесь ;)

echo '<br> ==========================';
